       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
      *=======================================================
      *== AUTOR: JHONATA                 EMPRESA:XPTO
      *== OBJETIVO:
      *== DATA: XX/XX/20XX
      *== OBSERVAÇÕES:
       ENVIRONMENT                     DIVISION.
       CONFIGURATION                   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE                 SECTION.



       PROCEDURE DIVISION.
           STOP RUN.
       0001-PRINCIPAL                  SECTION.
       0100-INICIALIZAR                SECTION.



       0200-PROCESSAR                  SECTION.



       0300-FINALIZAR                  SECTION.
